app/controllers/school_classes_controller.rb

    def index
        @classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def create
        @class = SchoolClass.create(permit_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 2], ["created_at", "2021-06-13 23:17:26.244242"], ["updated_at", "2021-06-13 23:17:26.244242"]]

    def show
        @class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        puts params
        @class = SchoolClass.find(params[:id])
        @class.update(permit_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 5], ["updated_at", "2021-06-13 23:21:09.238836"], ["id", 1]]

    def edit
        @class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]