app/controllers/students_controller.rb

    def create
        @student = Student.create(permit_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "George"], ["last_name", "Dilthey"], ["created_at", "2021-06-13 23:26:40.840254"], ["updated_at", "2021-06-13 23:26:40.840254"]]

    def update
        puts params
        @student = Student.find(params[:id])
        @student.update(permit_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordann"], ["updated_at", "2021-06-13 23:26:30.098388"], ["id", 1]]